# Reshaping Data

In [1]:
import pandas as pd
import seaborn as sns

## melt

: 멜트는 행을 녹여서 컬럼으로 보낸다는 느낌의 함수입니다.

In [16]:
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index=[1, 2, 3],
        columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [9]:
pd.melt(df)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

옵션을 지정하지 않으면 다음과 같은 형태로 데이터를 변형합니다.

In [10]:
pd.melt(df, id_vars=['a'], value_vars=['b'])

   a variable  value
0  4        b      7
1  5        b      8
2  6        b      9

다음은 a를 기준으로 b를 행으로 녹인다는 뜻입니다. 컬럼에 있었던 b가 행으로 녹아졌고 각각의 해당값는 값들이 value값으로 들어갔습니다.

## pivot

: pivot은 피벗 데이터블을 만들기 위한 함수입니다.

In [40]:
df = pd.DataFrame([
        ['20200101', 'A',   100],
        ['20200101', 'B',  200],
        ['20200101', 'C', 100],
        ['20200401', 'A',   150],
        ['20200401', 'B',  210],
        ['20200401', 'C', 40],
        ['20200701', 'A',   10],
        ['20200701', 'B',  50],
        ['20200701', 'C', 350],], 
    columns=['date', 'type', 'price'])

df

       date type  price
0  20200101    A    100
1  20200101    B    200
2  20200101    C    100
3  20200401    A    150
4  20200401    B    210
5  20200401    C     40
6  20200701    A     10
7  20200701    B     50
8  20200701    C    350

In [41]:
df = df.pivot(index='date', columns='type', values='price' )

In [42]:
df

type        A    B    C
date
20200101  100  200  100
20200401  150  210   40
20200701   10   50  350